cf/DataProcessors/ПомощникПоУчетуНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПоУчетуНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/AccumulationRegisters/НДСНачисленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>НДСНачисленный</Name>
			<Comment>(Регл) НДС, начисленный к уплате в бюджет</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходовБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДС</Name>
					<Comment>Субсчет 19 счета, на котором учитывается НДС</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Comment>Вид начисления НДС (реализация, налоговый агент, НДС с авансов)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НДСВидНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента (для СФ на аванс, нал.агента по 161.5)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/НДСРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>НДСРеализация0</Name>
			<Comment>НДС по реализации 0%</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсоваяРазница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Comment>Счет-фактура (документ реализации)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/ПомощникПоУчетуНДС/Ext/ObjectModule.bsl
Перем мСостояниеОпераций Экспорт;
Перем мПолноеДерево Экспорт;
Перем мУпрощенныйУчетНДС Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;

Процедура ОпределениеСпискаРекомендуемыхОпераций() Экспорт
	
	ОшибкаПолученияУчетнойПолитики = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ПериодРегистрации, ОшибкаПолученияУчетнойПолитики, Организация, "Нал");
	
	Если не ОшибкаПолученияУчетнойПолитики Тогда
		// Установка флагов по умолчанию
		ОрганизацияПлательщикНДС = не мУчетнаяПолитикаНУ.УСН;
		НДСНалоговыйПериод = УчетНДС.ПолучитьУПНДСНалоговыйПериод(Организация, ПериодРегистрации, мУчетнаяПолитикаНУ);
		СложныйУчетНДС = мУчетнаяПолитикаНУ.СложныйУчетНДС;
		ВыписыватьОтдельныеСчетаФактурыНаСуммовыеРазницы = Истина;
		мУпрощенныйУчетНДС = мУчетнаяПолитикаНУ.УпрощенныйУчетНДС;
	Иначе
		ОрганизацияПлательщикНДС = Истина;
		НДСНалоговыйПериод = УчетНДС.ПолучитьУПНДСНалоговыйПериод(Организация, ПериодРегистрации);
		СложныйУчетНДС = Ложь;
		ВыписыватьОтдельныеСчетаФактурыНаСуммовыеРазницы = Истина;
		мУпрощенныйУчетНДС = Ложь;
	КонецЕсли; 
	
	Если мУпрощенныйУчетНДС Тогда
		Для каждого ТекущаяОперация Из мПолноеДерево Цикл
			ТекущаяОперация.Контроль = Ложь;
		КонецЦикла;
		Возврат;
	КонецЕсли; 
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(?(НДСНалоговыйПериод = Перечисления.Периодичность.Квартал,НачалоКвартала(ПериодРегистрации),НачалоМесяца(ПериодРегистрации)), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода" , Новый Граница(?(НДСНалоговыйПериод = Перечисления.Периодичность.Квартал,КонецКвартала(ПериодРегистрации), КонецМесяца(ПериодРегистрации)), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериодаДата", ?(НДСНалоговыйПериод = Перечисления.Периодичность.Квартал,НачалоКвартала(ПериодРегистрации),НачалоМесяца(ПериодРегистрации)));
	Запрос.УстановитьПараметр("КонецПериодаДата" , ?(НДСНалоговыйПериод = Перечисления.Периодичность.Квартал,КонецКвартала(ПериодРегистрации), КонецМесяца(ПериодРегистрации)));
	Запрос.УстановитьПараметр("Организация"  , Организация);
	МассивСчетовАвансов = Новый Массив();
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным); // 62.02
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВал); // 62.22
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымУЕ); // 62.32
	
	ВидыСубконтоРасчеты = Новый Массив;
	ВидыСубконтоРасчеты.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоРасчеты.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконтоРасчеты.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	Запрос.УстановитьПараметр("ВидыСубконтоРасчеты", ВидыСубконтоРасчеты);
	
	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента);
	
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	
	// Движения по курсовым разницам не должны вызывать регистрации аванса
	Запрос.УстановитьПараметр("МассивСчетовАвансов", МассивСчетовАвансов);
	
	Запрос.УстановитьПараметр("ВидыЦенностейНА", УчетНДС.ВидыЦенностейНалоговыйАгент(Ложь));
	Запрос.УстановитьПараметр("ВидыЦенностейСМР", УчетНДС.ВидыЦенностейСМРХозспособ());
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОбъединенныеДанныеПоАвансам.РегламентнаяОперация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияСчетовФактурНаАванс) КАК РегламентнаяОперация
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Регистратор,
	               |				Счет В
	               |					(ВЫБРАТЬ
	               |						Хозрасчетный.Ссылка
	               |					ИЗ
	               |						ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |					ГДЕ
	               |						Хозрасчетный.Ссылка В ИЕРАРХИИ (&МассивСчетовАвансов)
	               |						И Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСконтрагентами)),
	               |				,
	               |				Организация = &Организация,
	               |				(НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВекселяПолученные)))
	               |					И (НЕ КорСчет В ИЕРАРХИИ (&МассивСчетовАвансов)),
	               |				) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		ВЫБОР
	               |				КОГДА УсловиеПоОборотам.Счет.Валютный
	               |						И (НЕ УсловиеПоОборотам.ВалютнаяСуммаОборотКт ЕСТЬ NULL )
	               |					ТОГДА УсловиеПоОборотам.ВалютнаяСуммаОборотКт
	               |				ИНАЧЕ УсловиеПоОборотам.СуммаОборотКт
	               |			КОНЕЦ > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияСчетовФактурНаАванс)
	               |	ИЗ
	               |		Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	               |	ГДЕ
	               |		ОтчетКомиссионераОПродажах.ДенежныеСредства.ВидОтчетаПоПлатежам = ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Аванс)
	               |		И ОтчетКомиссионераОПродажах.Дата МЕЖДУ &НачалоПериодаДата И &КонецПериодаДата) КАК ОбъединенныеДанныеПоАвансам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияСчетовФактурНалоговогоАгента)
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Период,
	               |			(НЕ СчетДт В (&СчетаИсключения)),
	               |			&ВидыСубконтоРасчеты,
	               |			,
	               |			,
	               |			Организация = &Организация
	               |				И СубконтоДт2.УчетАгентскогоНДС
	               |				И СубконтоДт2.НалоговыйАгентПоОплате
	               |				И (НЕ ЕСТЬNULL(СубконтоДт3.ДокументОснование, НЕОПРЕДЕЛЕНО) ССЫЛКА Документ.ВводНачальныхОстатков)) КАК УсловиеПоОборотам
	               |ГДЕ
	               |	УсловиеПоОборотам.СуммаОборот > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.НачислениеНДСпоСМРхозспособом)
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Период,
	               |			счет В ИЕРАРХИИ (&СчетСтроительство),
	               |			&СубконтоСтроительство,
	               |			Организация = &Организация
	               |				И Субконто1 = ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	               |				И ВЫБОР
	               |					КОГДА ГОД(&НачалоПериодаДата) < 2005
	               |						ТОГДА ЛОЖЬ
	               |					КОГДА ГОД(&НачалоПериодаДата) = 2005
	               |							И МЕСЯЦ(&НачалоПериодаДата) < 12
	               |						ТОГДА ЛОЖЬ
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ,
	               |			,
	               |			) КАК УсловиеПоОборотам
	               |ГДЕ
	               |	УсловиеПоОборотам.СуммаОборотДт > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияСчетовФактурНаСуммовыеРазницы)
	               |ИЗ
	               |	РегистрНакопления.НДСНачисленный.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Период,
	               |			&КонецПериодаДата < ДАТАВРЕМЯ(2011,10,1)
	               |				И Организация = &Организация
	               |				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СуммыСвязанныеСРасчетамиПоОплате)
	               |				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.НДСНачисленКУплате)) КАК УсловиеПоОборотам
	               |ГДЕ
	               |	УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УсловиеОперации.РегламентнаяОперация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА УсловиеПоОборотам.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
	               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ПодтверждениеНулевойСтавкиНДС)
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж0)
	               |		КОНЕЦ КАК РегламентнаяОперация
	               |	ИЗ
	               |		РегистрНакопления.НДСРеализация0.Обороты(&НачалоПериода, &КонецПериода, Период, Организация = &Организация) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА УсловиеПоОстаткам.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
	               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ПодтверждениеНулевойСтавкиНДС)
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж0)
	               |		КОНЕЦ
	               |	ИЗ
	               |		РегистрНакопления.НДСРеализация0.Остатки(&НачалоПериода, Организация = &Организация) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0) КАК УсловиеОперации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УсловиеОперации.РегламентнаяОперация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок0) КАК РегламентнаяОперация
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленныйРеализация0.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				Организация = &Организация
	               |					И (НЕ Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение))) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок0)
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
	               |				&НачалоПериода,
	               |				Организация = &Организация
	               |					И (НЕ Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение))) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0) КАК УсловиеОперации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РаспределениеНДСКосвенныхРасходов)
	               |ИЗ
	               |	РегистрНакопления.НДСКосвенныеРасходы.Обороты(&НачалоПериода, &КонецПериода, Период, Организация = &Организация) КАК УсловиеПоОборотам
	               |ГДЕ
	               |	УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УсловиеОперации.РегламентнаяОперация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияОплатыНДСВБюджет) КАК РегламентнаяОперация
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленный.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				Организация = &Организация
	               |					И ВидЦенности В (&ВидыЦенностейНА)
	               |					И ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |					И ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияОплатыНДСВБюджет)
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленный.Остатки(
	               |				&НачалоПериода,
	               |				Организация = &Организация
	               |					И ВидЦенности В (&ВидыЦенностейНА)
	               |					И ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |					И ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияОплатыНДСВБюджет)
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленный.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				Организация = &Организация
	               |					И ВидЦенности В (&ВидыЦенностейСМР)
	               |					И ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.РегистрацияОплатыНДСВБюджет)
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленный.Остатки(
	               |				&НачалоПериода,
	               |				Организация = &Организация
	               |					И ВидЦенности В (&ВидыЦенностейСМР)
	               |					И ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0) КАК УсловиеОперации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УсловиеОперации.РегламентнаяОперация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА УсловиеПоОборотам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0)
	               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ВосстановлениеНДС)
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж)
	               |		КОНЕЦ КАК РегламентнаяОперация
	               |	ИЗ
	               |		РегистрНакопления.НДСНачисленный.Обороты(&НачалоПериода, &КонецПериода, Период, Организация = &Организация) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА УсловиеПоОстаткам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0)
	               |				ТОГДА НЕОПРЕДЕЛЕНО
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж)
	               |		КОНЕЦ
	               |	ИЗ
	               |		РегистрНакопления.НДСНачисленный.Остатки(&НачалоПериода, Организация = &Организация) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0) КАК УсловиеОперации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УсловиеОперации.РегламентнаяОперация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок) КАК РегламентнаяОперация
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленный.Обороты(&НачалоПериода, &КонецПериода, Период, Организация = &Организация) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок)
	               |	ИЗ
	               |		РегистрНакопления.НДСПредъявленный.Остатки(&НачалоПериода, Организация = &Организация) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок)
	               |	ИЗ
	               |		РегистрНакопления.НДСсАвансов.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				Организация = &Организация
	               |					И (ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)
	               |						ИЛИ ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные0))) КАК УсловиеПоОборотам
	               |	ГДЕ
	               |		УсловиеПоОборотам.СуммаБезНДСПриход + УсловиеПоОборотам.НДСПриход > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок)
	               |	ИЗ
	               |		РегистрНакопления.НДСсАвансов.Остатки(
	               |				&НачалоПериода,
	               |				Организация = &Организация
	               |					И (ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)
	               |						ИЛИ ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные0))) КАК УсловиеПоОстаткам
	               |	ГДЕ
	               |		УсловиеПоОстаткам.СуммаБезНДСОстаток + УсловиеПоОстаткам.НДСОстаток > 0) КАК УсловиеОперации";
	   
	Запрос.УстановитьПараметр("СчетСтроительство", ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств);
	Запрос.УстановитьПараметр("СубконтоСтроительство", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства);
	
	ОперацииТребующиеКонтроля = Новый списокЗначений();
	ОперацииТребующиеКонтроля.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РегламентнаяОперация"));
	
	КонтролируемыеОперации = Новый Соответствие();
	
	// Обороты по СМР хозспособом
	ЕстьСтроительствоХозспособом = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.НачислениеНДСпоСМРхозспособом) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.НачислениеНДСпоСМРхозспособом, ОрганизацияПлательщикНДС и ЕстьСтроительствоХозспособом);
	
	// Наличие незавершенных расчетов с бюджетом (налоговый агент, строительство)
	ЗадолженностьПоОплатеВБюджет = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.РегистрацияОплатыНДСВБюджет) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.РегистрацияОплатыНДСВБюджет, ЗадолженностьПоОплатеВБюджет или ЕстьСтроительствоХозспособом);
	
	// Проверка наличия авансов
	НаличиеАвансов = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНаАванс) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНаАванс, ОрганизацияПлательщикНДС и НаличиеАвансов);
	
	// Проверка наличия оплат при исполнении обязанностей налогового агента
	НаличиеНА = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНалоговогоАгента) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНалоговогоАгента, ОрганизацияПлательщикНДС и НаличиеНА);
	
	// Проверка выписки отдельных СФ на суммовую разницу (по УП НУ)
	НаличиеВыделенныхСуммовых = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНаСуммовыеРазницы) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНаСуммовыеРазницы, ОрганизацияПлательщикНДС и ВыписыватьОтдельныеСчетаФактурыНаСуммовыеРазницы и НаличиеВыделенныхСуммовых);
	
	// Распределения косвенных расходов для сложного учета НДС (по УП НУ)
	НаличиеКосвенныхРасходовКРаспределению = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.РаспределениеНДСКосвенныхРасходов) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.РаспределениеНДСКосвенныхРасходов, ОрганизацияПлательщикНДС и НаличиеКосвенныхРасходовКРаспределению);
	
	// Наличие реализации по 0%
	ЕстьРеализация0КПодтверждению = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.ПодтверждениеНулевойСтавкиНДС) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ПодтверждениеНулевойСтавкиНДС, ЕстьРеализация0КПодтверждению);
	
	ЕстьРеализация0КОтражениюВКнигеПродаж = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж0) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж0, ЕстьРеализация0КОтражениюВКнигеПродаж);
	
	ЕстьРеализация0КОтражениюВКнигеПокупок = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок0) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок0, ЕстьРеализация0КОтражениюВКнигеПокупок);
	
	// Необходимость восстановления НДС
	РеализацияПод0_ТребуетсяВосстановление = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.ВосстановлениеНДС) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ВосстановлениеНДС, РеализацияПод0_ТребуетсяВосстановление);
	
	ЕстьПоступленияКОтражениюВКнигеПокупок = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПокупок, ОрганизацияПлательщикНДС и ЕстьПоступленияКОтражениюВКнигеПокупок);
	
	ЕстьРеализацияКОтражениюВКнигеПродаж = (не ОперацииТребующиеКонтроля.НайтиПоЗначению(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж) = неопределено);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ФормированиеЗаписейКнигиПродаж, ЕстьРеализацияКОтражениюВКнигеПродаж);
	
	// Конец года
	КонецГода_С2006 =  (Месяц(УчетНДС.ПолучитьКонецПериодаПоУчетнойПолитике(Организация, ПериодРегистрации, Ложь, Новый Структура("НДСНалоговыйПериод", НДСНалоговыйПериод))) = 12);
	КонтролируемыеОперации.Вставить(Перечисления.РегламентныеОперации.ВосстановлениеНДСПоОбъектамНедвижимости, ОрганизацияПлательщикНДС и КонецГода_С2006);
	
	Для каждого ТекущаяОперация Из мПолноеДерево Цикл
		ТекущаяОперация.Контроль = КонтролируемыеОперации[ТекущаяОперация.Узел];
	КонецЦикла; 
	
КонецПроцедуры

мСостояниеОпераций = Новый Соответствие;
